Confirmed:



Case#1 without ignore warning

  + resource "google_bigtable_app_profile" "ap1" {
      + app_profile_id  = "tf-profile-single"
      + id              = (known after apply)
      + ignore_warnings = false
      + instance        = "tf-instance"
      + name            = (known after apply)
      + project         = (known after apply)

      + single_cluster_routing {
          + allow_transactional_writes = true
          + cluster_id                 = "tf-instance-cluster"
        }
    }

tf destroy

│ Error: Error when reading or editing AppProfile: googleapi: Error 400: Deleting an app profile will cause all requests using it to fail.
│ Details:

Case #2 with ignore warning

ignore_warnings = true

tf destroy

# no error message.